In [ ]:
import pandas as pd
from dotenv import load_dotenv
import sqlalchemy

load_dotenv()
database_url = os.getenv('DATABASE_URL', default='sqlite:///temporary.db')

def get_db() -> sqlalchemy.engine.base.Connection:
    """Get a SQLAlchemy database connection.

    Uses this environment variable if it exists:
    DATABASE_URL=dialect://user:password@host/dbname

    Otherwise uses a SQLite database for initial local development.
    """
    load_dotenv()
    database_url = os.getenv('DATABASE_URL', default='sqlite:///temporary.db')
    engine = sqlalchemy.create_engine(database_url)
    connection = engine.connect()
    try:
        yield connection
    finally:
        connection.close()
conn = get_db()

In [2]:
!pwd

/home/primefactorx01/lambda/labs/labspt15-cityspire-g-ds

In [4]:
from pathlib import Path

In [7]:
path = Path('new_rent_data/2021.xlsx')

In [8]:
dataf = pd.read_excel(path)

In [9]:
dataf[['areaname21','state_alpha', 'rent50_2']]

                                    areaname21 state_alpha  rent50_2
0                              Abilene, TX MSA          TX      1028
1     Aguadilla-Isabela, PR HUD Metro FMR Area          PR       472
2      Utuado Municipio, PR HUD Metro FMR Area          PR       444
3                                Akron, OH MSA          OH       911
4                               Albany, GA MSA          GA       814
...                                        ...         ...       ...
2592                  Northern Mariana Islands          MP       826
2593             Puerto Rico HUD Nonmetro Area          PR       450
2594                      St. Croix Island, VI          VI      1154
2595                       St. John Island, VI          VI      1812
2596                     St. Thomas Island, VI          VI      1307

[2597 rows x 3 columns]

In [10]:
# dirpath = Path('notebooks/new_rent_data')
# dfs = []
# default = ['Areaname', 'state_alpha', 'Rent50_2']
# col_names = {
#     '2003.xls': ['msaname', 'State_Alpha', 'rent50_2'],
#     '2004.xls': ['MSAName', 'State_Alpha', 'Rent50_2'],
#     '2005.xls': ['MSAName', 'State_Alpha', 'Rent50_2Bed'],
#     '2006.xls': ['areaname', 'state_alpha', 'Rent50_2'],
#     '2007.xls': ['areaname', 'state_alpha', 'Rent50_2'],
#     '2008.xls': ['Areaname', 'state_alpha', 'Rent50_2'],
#     '2016.xlsx': ['areaname', 'state_alpha', 'Rent50_2'],
#     '2017.xlsx': ['areaname', 'state_alpha', 'Rent50_2'],
#     '2018.xlsx': ['areaname18', 'state_alpha', 'rent50_2'],
#     '2019.xlsx': ['areaname19', 'state_alpha', 'rent50_2'],
# }
# pd.read_excel('notebooks/new_rent_data/2019.xlsx')

In [11]:
df = pd.read_excel('new_rent_data/2021.xlsx')

In [12]:
df['areaname21'] = df['areaname21'].str.split(',', expand=True)[0]

In [13]:
df = df[['areaname21','state_alpha', 'rent50_2']].rename(columns={'areaname21':'City','state_alpha':'State', 'rent50_2': 'Rent'})

In [14]:
df.loc[df['City'].str.contains('-'), 'City'] = df.loc[df['City'].str.contains('-'), 'City'].str.split('-')

In [15]:
df =df.explode('City')

In [16]:
df.loc[:,'City'] =df.loc[:,'City'].str.strip()

In [17]:
df.loc[:,'State'] =df.loc[:,'State'].str.strip()

In [18]:
df.to_csv('rent_cleaned.csv')

In [127]:
pd.read_csv('rent_cleaned.csv')

      Unnamed: 0                           City State  Rent
0              0                        Abilene    TX  1028
1              1                      Aguadilla    PR   472
2              1                        Isabela    PR   472
3              2               Utuado Municipio    PR   444
4              3                          Akron    OH   911
...          ...                            ...   ...   ...
2826        2592       Northern Mariana Islands    MP   826
2827        2593  Puerto Rico HUD Nonmetro Area    PR   450
2828        2594               St. Croix Island    VI  1154
2829        2595                St. John Island    VI  1812
2830        2596              St. Thomas Island    VI  1307

[2831 rows x 4 columns]

In [28]:
df

                               City State  Rent
0                           Abilene    TX  1028
1                         Aguadilla    PR   472
1                           Isabela    PR   472
2                  Utuado Municipio    PR   444
3                             Akron    OH   911
...                             ...   ...   ...
2592       Northern Mariana Islands    MP   826
2593  Puerto Rico HUD Nonmetro Area    PR   450
2594               St. Croix Island    VI  1154
2595                St. John Island    VI  1812
2596              St. Thomas Island    VI  1307

[2831 rows x 3 columns]

In [25]:
conn = get_db()
df.to_sql(name = "rental_data", con = next(conn), if_exists='replace', index=False, method='multi')

In [31]:
conn = get_db()
q = """SELECT * FROM rental_data"""
pd.read_sql(q, con = next(conn))

                               City State  Rent
0                           Abilene    TX  1028
1                         Aguadilla    PR   472
2                           Isabela    PR   472
3                  Utuado Municipio    PR   444
4                             Akron    OH   911
...                             ...   ...   ...
2826       Northern Mariana Islands    MP   826
2827  Puerto Rico HUD Nonmetro Area    PR   450
2828               St. Croix Island    VI  1154
2829                St. John Island    VI  1812
2830              St. Thomas Island    VI  1307

[2831 rows x 3 columns]

In [33]:
from pypika import Query, Table, Field

In [34]:
rental_data = Table('rental_data')

In [62]:
q=Query.from_(rental_data).select(rental_data.Rent).where(rental_data.City == 'Sacramento').where(rental_data.State == "CA")
str(q)

'SELECT "Rent" FROM "rental_data" WHERE "City"=\'Sacramento\' AND "State"=\'CA\''

In [40]:
conn = get_db()
pd.read_sql(str(q), con = next(conn))

   Rent
0  1606